SM_для_EDT/src/Catalogs/vftШаблоныРДО/vftШаблоныРДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftШаблоныРДО</name>
  <attributes>
    <name>КодШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетныйВидОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможноАвтоматическоеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельРДО</name>
    <type>
      <types>CatalogRef.впМодельРДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчисткаВидаОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортовыйШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураФайла</name>
    <attributes>
      <name>Структура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъединятьСПредыдущей</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьЕслиНеЗаполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеЗаполнятьПослеПараметра</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбязательныеРеквизиты</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоНаНачалоМесяца</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыОпераций</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>CatalogRef.vftТиповыеОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/vftШаблоныРДО/ManagerModule.bsl
&НаСервере
Функция ПолучитьСписокШаблонов(МодельРДО) Экспорт
	
	Список = Новый ТаблицаЗначений;
	Список.Колонки.Добавить("Шаблон");
	//raruskzn AydaFZ 15.11.2019{

	//Список.Колонки.Добавить("КодШаблона");
	//Список.Колонки.Добавить("Код");
	
	//ВыборкаСправочник = Справочники.vftШаблоныРДО.Выбрать();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	vftШаблоныРДО.Ссылка КАК Шаблон
		|ИЗ
		|	Справочник.vftШаблоныРДО КАК vftШаблоныРДО
		|ГДЕ
		|	НЕ vftШаблоныРДО.ПометкаУдаления
		|	И (&ИгнорироватьМодельРДО
		|			ИЛИ vftШаблоныРДО.МодельРДО = &МодельРДО)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодШаблона,
		|	Код";
	
	Запрос.УстановитьПараметр("ИгнорироватьМодельРДО", Не ЗначениеЗаполнено(МодельРДО));
	Запрос.УстановитьПараметр("МодельРДО", МодельРДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Список = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Шаблон");
		
	КонецЕсли;
	//Пока ВыборкаСправочник.Следующий() Цикл
	//	
	//	НовыйШаблон = Список.Добавить();
	//	
	//	НовыйШаблон.Шаблон = ВыборкаСправочник.Ссылка;
	//	НовыйШаблон.КодШаблона = ВыборкаСправочник.КодШаблона;
	//	НовыйШаблон.Код = ВыборкаСправочник.Код;
	//	
	//КонецЦикла; 
	
	//Список.Сортировать("КодШаблона,Код");
	//ВозвратСписок = Список.ВыгрузитьКолонку("Шаблон");
		
	Возврат Список;
	//raruskzn AydaFZ 15.11.2019}

КонецФункции

&НаСервере
Функция ЕстьРеквизитВШаблоне(Ссылка) Экспорт
	 		
КонецФункции

&НаСервере
Функция ЭтоУдаляемыйРеквизит(Ссылка, ИмяРеквизита, НомерСтроки) Экспорт
	СтрокаДанных = Ссылка.СтруктураФайла[НомерСтроки - 1].Структура;
	ЕстьУдаляемыеЧасти = Найти(СтрокаДанных,"\");
	Если Не ЕстьУдаляемыеЧасти Тогда
		Возврат Ложь;
	Иначе
		Пока ЕстьУдаляемыеЧасти Цикл
		//проверим, есть ли не заполненные части
		НомерПервого = 0;
		НомерПоследнего = 0;
		Для НомерСимвола = 0 По СтрДлина(СтрокаДанных)  Цикл
			Если Символ(КодСимвола(СтрокаДанных,НомерСимвола))="\" И НомерПервого = 0 Тогда
				НомерПервого = НомерСимвола;
			ИначеЕсли Символ(КодСимвола(СтрокаДанных,НомерСимвола))="\" И НомерПервого <> 0 Тогда 
				НомерПоследнего = НомерСимвола;
				Прервать;
			КонецЕсли; 	
			
			
		КонецЦикла;
		
		ПодстрокаПоиска = Сред(СтрокаДанных,НомерПервого,НомерПоследнего-НомерПервого+1);
		СимволПоказателя = Найти(ПодстрокаПоиска,"["+ИмяРеквизита);
		Если СимволПоказателя Тогда
			Возврат Истина;
		Иначе
			
			СтрокаДанных = СтрЗаменить(СтрокаДанных,ПодстрокаПоиска,"");
			ЕстьУдаляемыеЧасти = Найти(СтрокаДанных,"\");
			Продолжить;
		КонецЕсли; 
		
		
		
		ЕстьУдаляемыеЧасти = Найти(СтрокаДанных,"\");
	КонецЦикла;
КонецЕсли;

Возврат Ложь;
		
КонецФункции
